use Kursova

INSERT INTO Kafedra(Kafedra_name, Kafedra_description) VALUES
('ІСТ',' інформаційних систем та технологій '),
('ІПІ','інформатики та програмної інженерії'),
('ОТ','обчислювальної техніки'),
('КС','Кафедра соціологі'),
('ЕТРП','Кафедра екології та технології рослинний полімерів'),
('ПП','Кафедра психології і педагогики ')

INSERT INTO Teacher(Teacher_name,Teacher_surname,Teacher_patronymic,Teacher_adresse) VALUES
('Орлова','Олександра','Олександрівна','Київ проспект Перемоги 6'),
('Килик','Петро','Дмитріївна','Київ проспект Науки 3'),
('Доброволь', 'Олександра','Михайліївна','Київ проспект Перемоги 32б'),
('Гулька', 'Стефанія','Андріївна','Київ Сирецька 2'),
('Козлокова', 'Вікторія','Анатоліївна','Одеса Генуезька вулиця 24A'),
('Петров','Олег','Петрович','Київ проспект Перемоги 13')

INSERT INTO Discipline (Disciplines_name, Disciplines_description, Kafedra_id, Teacher_id) VALUES
('Лінуксоподібні операційні системи','Архітектура і побудова Linux-подібних операційних систем,',1,1),
('Емпіричні методи програмної інженерії', 'Методи тазасоби емпіричнихдосліджень, актуальнихв аспекті ПЗ',2,2),
('Комп’ютерна графіка та мультимедіа','Проводити аналіз та обирати відповідні до поставленої задачі методи',3,3),
('Актуальні проблеми азійських спільнот','Процеси забруднення атмосфери, гідросфери та літосфери ',4,4),
('Промислова екологія','Динамізм розвитку країн азійського регіону,',5,5),
('Економічна психологія','Економічна психологія вивчає уявлення індивідів і груп про економічні явища і поведінку',6,6)

INSERT INTO Student(Student_name,Student_surname,Student_patronymic,Student_kurs,
Student_adresse,Student_telefon ) VALUES
('Бігунець','Оксана','Анатоліївна', 2, 'Київ, проспект Перемоги 32a','0732030617'),
('Голуб','Степан','Олексійович', 3, 'Львів, вул. Васильківська 1', '096789054'),
('Кофтун','Анна','Леонідівна', 2, 'Одеса, вул. Грецька 2', '073189010'),
('Килим','Олена','Вікторівна', 1, 'Київ, проспект Берестейський 66', '0971890321'),
('Билик','Артем','Олегович', 2, 'Харків, вул. Культури 4', '073189832'),
('Машичкин','Дмитро','Олегович', 4, 'Харків, вул. Культури 7', '073278334')


INSERT INTO NewDiscipline(NewDiscipline_name,NewDiscipline_description, Kafedra_id, Teacher_id) VALUES
('Системи масового обслуговування','Основні відомості та поняття з теорії масового обслуговування',1,1),
('Нечітка логіка','Розвиток нечіткої логіки йде по шляху створення систем, що потрібні великому бізнесу і військовим',2,2),
('Мова програмування Java','передбачає вивчення ядра мовиJava',3,3),
('Системне програмування С і С++','Демонструє типовий підхід до розробки програм з використанням мов С, С++ для ОС Windows і Linux',4,4),
('Сучасні технології розробки WEB-застосувань на платформі Microsoft.NET','Устрій .Net коду та синтаксичні засоби його побудови: узагальнені типи даних, делегати, подїї, лямбда-вирази та інш.',5,5),
('Сучасні технології розробки WEB-застосувань на платформі Java','побудова веб-застосунків за технологією Enterprise Edition (Servlets, Filters, JSP, JSTL);',6,6)

